{
  "last_updated": "31.12.2025",
  "mascot_message": "Привіт! Я оновила правила нашої Спільноти. Перед тим як ми продовжимо, будь ласка, прочитай і підтвердь їх, щоб ми були на одній хвилі! (´• ω •`)",
  "text": "УГОДА КОРИСТУВАЧА ТА ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ CL (Clegendary Launcher)\n\n1. ЗАГАЛЬНІ ПОЛОЖЕННЯ\nЦя Угода регулює відносини між користувачем та розробником CL (Clegendary Launcher). Завантажуючи, встановлюючи або використовуючи Лаунчер, ви беззастережно погоджуєтеся з усіма умовами цієї угоди. Якщо ви не згодні з будь-яким пунктом, ви зобов'язані негайно припинити використання програми та видалити її.\n\n2. ЛІЦЕНЗІЯ ТА ПРАВА\nВам надається обмежена, невиключна ліцензія на використання Лаунчера виключно в особистих некомерційних цілях. Лаунчер надається безкоштовно.\n\nДОЗВОЛЯЄТЬСЯ:\n• Декомпіляція та дослідження програмного коду виключно в ознайомчих та навчальних цілях.\n\nЗАБОРОНЕНО:\n• Використовувати вихідний код або ресурси Лаунчера для створення похідних продуктів, клонів або конкурентних сервісів.\n• Використовувати програму для шахрайства, поширення шкідливого ПЗ або будь-яких незаконних дій.\n• Продавати або здавати в оренду доступ до Лаунчера.\n\n3. КОНФІДЕНЦІЙНІСТЬ ТА ЗБІР ДАНИХ\nМи поважаємо вашу приватність. Лаунчер збирає МІНІМАЛЬНИЙ обсяг технічних даних:\n• Інформація про версію Лаунчера (для перевірки оновлень).\n• Ми НЕ збираємо паролі, особисті файли, історію браузера або будь-які інші персональні дані.\n• Ми не передаємо жодних даних третім особам.\n\n4. ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ (DISCLAIMER)\nПрограма надається за принципом \"ЯК Є\" (AS IS). Розробник не гарантує безпомилкову роботу програми та не несе відповідальності за:\n• Будь-які збитки, втрату даних або збої в роботі комп'ютера.\n• Роботу сторонніх модів, серверів чи скінів.\n\n5. ВІДСУТНІСТЬ ЗВ'ЯЗКУ З MOJANG/MICROSOFT\nCL (Clegendary Launcher) є незалежною розробкою і НЕ є офіційним продуктом Mojang AB або Microsoft Corporation. Ми закликаємо вас придбати ліцензійну версію гри Minecraft на офіційному сайті minecraft.net. Підтримка піратства не є метою цього ПЗ.\n\n6. ПРИПИНЕННЯ ДІЇ\nРозробник залишає за собою право припинити підтримку Лаунчера або відкликати вашу ліцензію на використання у разі порушення вами умов цієї Угоди.\n\n7. ЗМІНИ УМОВ\nЦя угода може бути оновлена розробником. Продовження використання Лаунчера після оновлення означає вашу згоду з новими умовами.\n\n8. КОНТАКТИ\nУ разі виникнення питань ви можете звернутися до адміністрації через Discord: clegendary."
}
