{
  "last_updated": "09.02.2026",
  "mascot_message": "Привіт! Я оновила правила нашої Спільноти. Тепер ми Open Source, тому правила трохи змінилися (додано захист дизайну та API). Будь ласка, прочитай і підтвердь їх! (´• ω •`)",
  "text": "УГОДА КОРИСТУВАЧА ТА ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ CL (Clegendary Launcher)\n\n1. ЗАГАЛЬНІ ПОЛОЖЕННЯ ТА OPEN SOURCE\nЦя Угода регулює відносини між користувачем та розробниками CL (Clegendary Launcher). Встановлюючи програмне забезпечення, ви погоджуєтеся з умовами цієї Угоди.\n• Вікові обмеження: Використовуючи ПЗ, ви підтверджуєте, що досягли віку, який дозволяє самостійно приймати умови цієї Угоди згідно із законодавством вашої країни, або маєте на це дозвіл батьків/опікунів.\n• Ліцензія: CL є програмним забезпеченням з відкритим вихідним кодом. Логіка та код проекту розповсюджуються на умовах ліцензії GNU General Public License v3.0 (GPLv3). Ви маєте право вивчати, змінювати та поширювати код згідно з умовами цієї ліцензії.\n\n2. ЗАХИСТ ТОРГОВОЇ МАРКИ, ДИЗАЙНУ ТА API (TRADEMARK & ASSETS)\nМи використовуємо гібридну модель ліцензування. Код є відкритим, але Візуальний Стиль та Ключі доступу — ні.\n• Trade Dress: Назва \"CL (Clegendary Launcher)\", логотипи, іконки, фонові зображення та унікальні елементи інтерфейсу є власністю розробників і НЕ підпадають під дію ліцензії GPLv3.\n• Правила для форків: Якщо ви створюєте власну версію лаунчера (форк), ви ЗОБОВ'ЯЗАНІ:\n   1. Змінити назву програми та повністю замінити всі графічні ресурси (брендинг) на власні.\n   2. Використовувати власні API-ключі (Client IDs/API Keys) для сервісів Microsoft, CurseForge та інших. Використання ключів оригінального проекту CL у похідних продуктах заборонено.\n\n3. КОНФІДЕНЦІЙНІСТЬ, ЗБІР ДАНИХ ТА ОНОВЛЕННЯ\nМи поважаємо вашу приватність. Лаунчер працює за принципом мінімізації даних.\n• Локальні дані: Ваші токени авторизації, налаштування та логи зберігаються лише на вашому пристрої.\n• Оновлення: Програма може автоматично надсилати анонімні технічні запити до наших серверів для перевірки наявності оновлень та їх завантаження задля забезпечення безпеки та стабільності.\n• Ми НЕ збираємо: Паролі, особисті файли, історію браузера.\n\n4. СТОРОННІ СЕРВІСИ ТА КОНТЕНТ\nЛаунчер взаємодіє зі сторонніми сервісами: Microsoft (Xbox Live), Mojang Studios, CurseForge, Modrinth, LittleSkin. Використовуючи їх, ви погоджуєтесь з їхніми умовами.\n• Модифікації: Лаунчер надає лише технічний доступ до каталогів модів. Ми не є авторами модифікацій, ресурс-паків чи модпаків, які ви завантажуєте, і не здійснюємо їх премодерацію.\n\n5. ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ (DISCLAIMER)\nПрограма надається за принципом \"ЯК Є\" (AS IS), без будь-яких гарантій. Проект перебуває в стадії активної розробки.\nРозробники не несуть відповідальності за:\n• Будь-які збитки, втрату даних або збої в роботі обладнання.\n• Некоректну роботу сторонніх модів, серверів чи скінів.\n• Блокування акаунтів: Ми не несемо відповідальності за будь-які санкції (бани, обмеження доступу), застосовані до вашого ігрового акаунту адміністрацією серверів або Mojang/Microsoft внаслідок використання цього ПЗ, модів або чітів.\n• Ви використовуєте програмне забезпечення на власний ризик.\n\n6. ВІДСУТНІСТЬ ЗВ'ЯЗКУ З MOJANG/MICROSOFT\nCL (Clegendary Launcher) є незалежною розробкою і НЕ є офіційним продуктом Mojang Studios або Microsoft Corporation. Ми закликаємо вас використовувати ліцензійну копію гри Minecraft.\n\n7. ЗМІНИ ТА КОНТАКТИ\nЦя угода може бути оновлена розробником. Продовження використання Лаунчера означає вашу згоду.\nКонтакти (Discord): clegendary."
}
