{
  "last_updated": "10.01.2026",
  "mascot_message": "Привіт! Я оновила правила нашої Спільноти. Тепер ми Open Source, тому правила трохи змінилися (додано захист дизайну). Будь ласка, прочитай і підтвердь їх! (´• ω •`)",
  "text": "УГОДА КОРИСТУВАЧА ТА ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ CL (Clegendary Launcher)\n\n1. ЗАГАЛЬНІ ПОЛОЖЕННЯ ТА OPEN SOURCE\nЦя Угода регулює відносини між користувачем та розробниками CL (Clegendary Launcher). Встановлюючи програмне забезпечення, ви погоджуєтеся з умовами цієї Угоди.\nCL (Clegendary Launcher) є програмним забезпеченням з відкритим вихідним кодом. Логіка та код проекту розповсюджуються на умовах ліцензії GNU General Public License v3.0 (GPLv3). Ви маєте право вивчати, змінювати та поширювати код згідно з умовами цієї ліцензії.\n\n2. ЗАХИСТ ТОРГОВОЇ МАРКИ ТА ДИЗАЙНУ (TRADEMARK & ASSETS)\nМи використовуємо гібридну модель ліцензування. Код є відкритим, але Візуальний Стиль — ні.\n• Назва \"CL (Clegendary Launcher)\", \"CL Launcher\", логотипи, іконки, фонові зображення та унікальні елементи інтерфейсу становлять \"Trade Dress\" (Комерційний вигляд) і є власністю розробників.\n• Ці візуальні асети НЕ підпадають під дію ліцензії GPLv3.\n• Якщо ви створюєте власну версію лаунчера (форк), ви ЗОБОВ'ЯЗАНІ змінити назву програми та повністю замінити всі графічні ресурси та елементи брендингу на власні.\n\n3. КОНФІДЕНЦІЙНІСТЬ ТА ЗБІР ДАНИХ\nМи поважаємо вашу приватність. Лаунчер працює за принципом мінімізації даних.\n• Локально зберігаються: Ваші токени авторизації, налаштування та логи.\n• Технічні дані: Лаунчер може надсилати анонімні запити для перевірки оновлень.\n• Ми НЕ збираємо: Паролі, особисті файли, історію браузера.\n\n4. СТОРОННІ СЕРВІСИ\nЛаунчер взаємодіє зі сторонніми сервісами: Microsoft (Xbox Live), Mojang Studios, CurseForge, Modrinth, LittleSkin. Використовуючи їх, ви погоджуєтесь з їхніми умовами використання.\n\n5. ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ (DISCLAIMER)\nПрограма надається за принципом \"ЯК Є\" (AS IS), без будь-яких гарантій. Проект перебуває в стадії активної розробки.\nРозробники не несуть відповідальності за:\n• Будь-які збитки, втрату даних або збої в роботі обладнання.\n• Некоректну роботу сторонніх модів, серверів чи скінів.\n• Ви використовуєте програмне забезпечення на власний ризик.\n\n6. ВІДСУТНІСТЬ ЗВ'ЯЗКУ З MOJANG/MICROSOFT\nCL (Clegendary Launcher) є незалежною розробкою і НЕ є офіційним продуктом Mojang Studios або Microsoft Corporation. Ми закликаємо вас використовувати ліцензійну копію гри Minecraft.\n\n7. ЗМІНИ ТА КОНТАКТИ\nЦя угода може бути оновлена розробником. Продовження використання Лаунчера означає вашу згоду.\nКонтакти (Discord): clegendary."
}
