{
  "known_issues": [
    {
      "id": "out_of_memory",
      "keywords": [
        "java.lang.OutOfMemoryError",
        "Java heap space"
      ],
      "response": "1. Статус: Критична нестача оперативної пам'яті (RAM).\n2. Аналіз: Ваша гра або встановлені модифікації потребують більше оперативної пам'яті, ніж наразі виділено системі. Процес Java вичерпав свій ліміт і примусово зупинив виконання, щоб запобігти зависанню комп'ютера.\n3. Рішення:\n- Відкрийте налаштування CL Launcher.\n- Знайдіть повзунок виділення оперативної пам'яті (ОЗП).\n- Збільште значення принаймні до 4096 МБ (4 ГБ) або більше, якщо дозволяють характеристики вашого ПК.\n4. Кінець зв'язку: \"Борітеся — поборете! Вам Бог допомагає!\" — Тарас Шевченко. Агент Сі-Ел бажає вам стабільного FPS та успішної гри."
    },
    {
      "id": "wrong_java_version",
      "keywords": [
        "UnsupportedClassVersionError",
        "class file version 61.0",
        "class file version 65.0"
      ],
      "response": "1. Статус: Конфлікт версій середовища Java.\n2. Аналіз: Сучасні версії Minecraft (від 1.17 і вище) вимагають новіших версій Java (17 або 21). Ваша система намагається запустити гру, використовуючи застарілу версію (наприклад, Java 8), яка не здатна прочитати сучасний код гри.\n3. Рішення:\n- Завантажте та встановіть Java 17 або Java 21 з офіційного сайту.\n- Перейдіть у налаштування лаунчера.\n- У розділі шляху до Java вкажіть розташування нової версії (або дозвольте лаунчеру знайти її автоматично).\n4. Кінець зв'язку: \"Тільки той досягає мети, хто іде!\" — Олександр Олесь. Агент Сі-Ел сподівається, що оновлення пройде блискавично. Вдалої гри."
    },
    {
      "id": "missing_fabric_api",
      "keywords": [
        "requires fabric-api",
        "net.fabricmc.loader.impl.FormattedException: Mod resolution encountered an incompatible mod set"
      ],
      "response": "1. Статус: Відсутнє базове ядро Fabric API.\n2. Аналіз: Один або кілька встановлених модів вимагають для своєї роботи бібліотеку \"Fabric API\". Без цього системного компонента гра не розуміє, як правильно завантажити функції модифікації, що блокує подальший запуск.\n3. Рішення:\n- Знайдіть та завантажте мод \"Fabric API\" для вашої версії Minecraft.\n- Перемістіть завантажений файл .jar у папку mods вашої поточної збірки.\n4. Кінець зв'язку: \"Хто звільниться сам, той буде вільний, хто визволить кого, в полон візьме.\" — Леся Українка. Агент Сі-Ел бажає вам ідеальної сумісності модів."
    },
    {
      "id": "driver_opengl_error",
      "keywords": [
        "GLFW error 65542",
        "WGL: The driver does not appear to support OpenGL"
      ],
      "response": "1. Статус: Апаратна помилка графічного драйвера (OpenGL).\n2. Аналіз: Гра не змогла ініціалізувати графічне ядро OpenGL. Це означає, що ваші відеодрайвери застаріли, відсутні, або ваша відеокарта фізично не підтримує технології, необхідні для запуску цієї версії Minecraft.\n3. Рішення:\n- Відкрийте диспетчер пристроїв та дізнайтеся модель вашої відеокарти.\n- Перейдіть на офіційний сайт виробника (NVIDIA, AMD або Intel) та завантажте найсвіжіший драйвер.\n- Якщо у вас дуже старий ПК, спробуйте запустити старішу версію гри (наприклад, 1.12.2) або встановіть оптимізаційні модифікації.\n4. Кінець зв'язку: \"Нація, яка не готова захищати себе, приречена на загибель.\" — Степан Бандера. Агент Сі-Ел радить тримати ваше обладнання в повній бойовій готовності."
    }
  ]
}
